In [124]:
import pandas as pd

In [126]:
import numpy as np

In [128]:
data1={"EMPID":["E01","E02","E03","E04","E05"],
    "name":[None,"umer","ali","ahmed",None],
      "last_name":["khan","tanveer","amjd","umer","safeer"],
      "age":[20,23,None,24,None],
      "department":["cs","se","ds","it","bba"]}

In [129]:
df1=pd.DataFrame(data1)

In [130]:
print(df1)

  EMPID   name last_name   age department
0   E01   None      khan  20.0         cs
1   E02   umer   tanveer  23.0         se
2   E03    ali      amjd   NaN         ds
3   E04  ahmed      umer  24.0         it
4   E05   None    safeer   NaN        bba

In [133]:
data2={"EMPID":["E01","E02","E03","E04","E06"],
    "name":["tayyab","kashif","asad","tariq","qamar"],
      "last_name":["asad","tariq","kashif","hatim","john"],
       "salary":[1000,2000,3000,4000,5000],
      "age":[20,22,23,None,24],
      "department":["d_form","bs_maths","law","english","stats"]}

In [136]:
df2=pd.DataFrame(data2)

In [138]:
print(df2)

  EMPID    name last_name  salary   age department
0   E01  tayyab      asad    1000  20.0     d_form
1   E02  kashif     tariq    2000  22.0   bs_maths
2   E03    asad    kashif    3000  23.0        law
3   E04   tariq     hatim    4000   NaN    english
4   E06   qamar      john    5000  24.0      stats

In [139]:
pd.merge(df1,df2,on="EMPID")

,EMPID,name_x,last_name_x,age_x,department_x,name_y,last_name_y,salary,age_y,department_y
0,E01,None,khan,20.0,cs,tayyab,asad,1000,20.0,d_form
1,E02,umer,tanveer,23.0,se,kashif,tariq,2000,22.0,bs_maths
2,E03,ali,amjd,NaN,ds,asad,kashif,3000,23.0,law
3,E04,ahmed,umer,24.0,it,tariq,hatim,4000,NaN,english

In [142]:
pd.merge(right=df1,left=df2,on="EMPID",how="left")

,EMPID,name_x,last_name_x,salary,age_x,department_x,name_y,last_name_y,age_y,department_y
0,E01,tayyab,asad,1000,20.0,d_form,None,khan,20.0,cs
1,E02,kashif,tariq,2000,22.0,bs_maths,umer,tanveer,23.0,se
2,E03,asad,kashif,3000,23.0,law,ali,amjd,NaN,ds
3,E04,tariq,hatim,4000,NaN,english,ahmed,umer,24.0,it
4,E06,qamar,john,5000,24.0,stats,NaN,NaN,NaN,NaN

In [143]:
pd.merge(right=df1,left=df2,on="EMPID",how="inner")

,EMPID,name_x,last_name_x,salary,age_x,department_x,name_y,last_name_y,age_y,department_y
0,E01,tayyab,asad,1000,20.0,d_form,None,khan,20.0,cs
1,E02,kashif,tariq,2000,22.0,bs_maths,umer,tanveer,23.0,se
2,E03,asad,kashif,3000,23.0,law,ali,amjd,NaN,ds
3,E04,tariq,hatim,4000,NaN,english,ahmed,umer,24.0,it

In [144]:
data3={"salary":[2000,3000,4000,5000,6000],
       "cars":["BMW","MERCEDES","TOYOTA","RR","LAMBO"]}

In [145]:
df3=pd.DataFrame(data3)

In [148]:
complete_Data = df1.join(df3)

In [151]:
print(complete_Data)

  EMPID   name last_name   age department  salary      cars
0   E01   None      khan  20.0         cs    2000       BMW
1   E02   umer   tanveer  23.0         se    3000  MERCEDES
2   E03    ali      amjd   NaN         ds    4000    TOYOTA
3   E04  ahmed      umer  24.0         it    5000        RR
4   E05   None    safeer   NaN        bba    6000     LAMBO

In [152]:
df1.iloc[[1,3],[2,3]]

  last_name   age
1   tanveer  23.0
3      umer  24.0

In [156]:
df2.iloc[0:3,1:3]

     name last_name
0  tayyab      asad
1  kashif     tariq
2    asad    kashif

In [158]:
df1["name"].str.capitalize()

0     None
1     Umer
2      Ali
3    Ahmed
4     None
Name: name, dtype: object

# modification for source file

In [228]:
df1=df1.(df1["name"],inplace=True)

KeyError: "['unknown', 'umer', 'ali', 'ahmed', 'unknown'] not found in axis"

In [ ]:
print(df1)

In [163]:
df1['name'].fillna('unknown',inplace=True)
print(df1)

  EMPID     name last_name   age department
0   E01  unknown      khan  20.0         cs
1   E02     umer   tanveer  23.0         se
2   E03      ali      amjd   NaN         ds
3   E04    ahmed      umer  24.0         it
4   E05  unknown    safeer   NaN        bba

In [165]:
df2['age'].fillna(method="bfill")

C:\Users\admin\AppData\Local\Temp\ipykernel_3988\376674367.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2['age'].fillna(method="bfill")

0    20.0
1    22.0
2    23.0
3    24.0
4    24.0
Name: age, dtype: float64

In [167]:
df2['age'].fillna(method="ffill")

C:\Users\admin\AppData\Local\Temp\ipykernel_3988\41154609.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2['age'].fillna(method="ffill")

0    20.0
1    22.0
2    23.0
3    23.0
4    24.0
Name: age, dtype: float64

In [169]:
df2.isnull()

   EMPID   name  last_name  salary    age  department
0  False  False      False   False  False       False
1  False  False      False   False  False       False
2  False  False      False   False  False       False
3  False  False      False   False   True       False
4  False  False      False   False  False       False

In [171]:
df2.isnull().sum()

EMPID         0
name          0
last_name     0
salary        0
age           1
department    0
dtype: int64

In [173]:
df1.isnull().sum()

EMPID         0
name          0
last_name     0
age           2
department    0
dtype: int64

In [185]:
print(df2)

  EMPID    name last_name  salary   age department
0   E01  tayyab      asad    1000  20.0     d_form
1   E02  kashif     tariq    2000  22.0   bs_maths
2   E03    asad    kashif    3000  23.0        law
3   E04   tariq     hatim    4000   NaN    english
4   E06   qamar      john    5000  24.0      stats

In [193]:
mean_v=df2['age'].mean()

In [195]:
mean_v

22.25

In [222]:
df2['age'].fillna(value=df2['age'].mean())

0    20.00
1    22.00
2    23.00
3    22.25
4    24.00
Name: age, dtype: float64

In [224]:
print(df2)

  EMPID    name last_name  salary    age department
0   E01  tayyab      asad    1000  20.00     d_form
1   E02  kashif     tariq    2000  22.00   bs_maths
2   E03    asad    kashif    3000  23.00        law
3   E04   tariq     hatim    4000  22.25    english
4   E06   qamar      john    5000  24.00      stats